Revit 2027 API
SketchEditScope.IsElementWithoutSketch Method
 Validates if an element can have a sketch but currently does not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsElementWithoutSketch(
	ElementId elementId
)
Public Function IsElementWithoutSketch (
	elementId As ElementId
) As Boolean
public:
bool IsElementWithoutSketch(
	ElementId^ elementId
)
member IsElementWithoutSketch :
        elementId : ElementId -> bool
Parameters
elementId ElementId
 The element id to be checked.
Return Value
Boolean
 True if the element doesn't have a sketch, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SketchEditScope Class
Autodesk.Revit.DB Namespace